joypoo/STM32F103TFT_MCU_PC_HW/PrgMCU/USER/main.c
//
//  文 件 名   : main.c
//  版 本 号   :
//  作    者   :
//  生成日期   :
//  最近修改   : 2024-07-05，优化子页面跳转到主页的定位光标处理，增加长按“钥匙”按钮进入屏保功能
//							 2024-08-04，优化串口IRQ数据接收和处理
//	存在BUG描述: 最后一包图像数据由于4k对齐占据了一个扇区，有点浪费，程序中舍去保存和现实（图像上会出现半行黑线），从节省空间考虑可以放在第一包数据里
//  功能描述   : 
//              STM32F103 TFT开发板系列 
//              STM32F103C8T6
//              京东方玻璃 0.96 inch 80RGB*160DOTS MODULE NUMBER: ZJY096T-IF09 ST7735S Driver
//
//              按键
//              ----------------------------------------------------------------
//              KEY   PA0
//              
//							屏幕接线
//              ----------------------------------------------------------------
//              GND   电源地
//              VCC   3.3v电源
//              SCL   PB3（SCLK）
//              SDA   PB5（MOSI）
//              RES   PB6
//              DC    PB4
//              CS    PB7
//              ----------------------------------------------------------------
//
//							FLASH芯片接线
//              ----------------------------------------------------------------
//              GND   电源地
//              VCC   3.3v
//              CS    PB12
//              CLK   PB13
//              DO    PB14
//              DI    PB15
//              ----------------------------------------------------------------
//
//							BMP280接线
//              ----------------------------------------------------------------
//              GND   电源地
//              VCC   3.3V
//              SCL   (PC12)->PB10
//              SDA   (PC11)->PB11
//              
//							mcuisp串口下载，使用串口USART1，管脚PA9、PA10，下载程序选择STMISP下载模式
//							---------------------------------------------------------------
//							热进入:同时按住复位和BOOT按键,先松开复位按键约1S后松开BOOT0按键即进入BOOT下载模式。
//							冷进入:按住BOOT0按键后再接入USB电源约1S后松开BOOT0按键即进入BOOT下载模式。
//
//  片内FLASH及RAM分布
//  ---------------------------------------------------------------------------
//  RAM - RW-data/可读写数据段/被调用的已经初始且初始化不为0的全局数据
//  RAM - ZI-data/清零数据段/被调用的不初始或初始化为0的全局数据
//  FLASH - RO-data只读数据段
//  FLASH - Code代码段
//  ---------------------------------------------------------------------------

#include "delay.h"
#include "sys.h"
#include "led.h"
#include "lcd_init.h"
#include "lcd.h"
#include "pic.h"
#include "usart_1.h"
#include "W25QXX.h"
#include "bmp280.h"

#include "stm32f10x_tim.h"

//单个按键检测
//#define SingleKeyEvent 1
//#ifdef SingleKeyEvent
//#endif

//按键对应的IO管脚 PA.0
#define KEY_IO_RCC	RCC_APB2Periph_GPIOA
#define KEY_IO_PORT	GPIOA
#define KEY_IO_PIN	GPIO_Pin_0
//Key: 1:高电平，按键未按下， 0：低电平，按键按下
#define Key	GPIO_ReadInputDataBit(KEY_IO_PORT, KEY_IO_PIN)

typedef enum
{
    KEY_CHECK = 0,
    KEY_COMFIRM = 1,
    KEY_RELEASE = 2 
}KEY_STATE;

typedef enum 
{
    NULL_KEY = 0,
    SHORT_KEY = 1,
    LONG_KEY = 2
}KEY_TYPE;

KEY_STATE KeyState = KEY_CHECK;	// 初始化按键状态为检测状态
u8 g_KeyFlag = 0;								// 按键有效标志，0： 按键值无效； 1：按键值有效
KEY_TYPE g_KeyActionFlag;		//用于区别长按和短按
char bScreenMain = 1; //是否在主页面
char nSubMenu; //菜单1、2、3、4.0为不在子菜单页面

u8 bGetBMP280Flag = 0; //是否可以获取BMP280数据

//-----------------

typedef enum { FAILED = 0, PASSED = !FAILED } TestStatus;

/* 获取缓冲区的长度 */
#define TxBufferSize1   (countof(TxBuffer1) - 1)
#define RxBufferSize1   (countof(TxBuffer1) - 1)
#define countof(a)      (sizeof(a) / sizeof(*(a)))
#define	BufferSize		(countof(Tx_Buffer)-1)

#define  FLASH_WriteAddress     0x00000
#define  FLASH_ReadAddress      FLASH_WriteAddress
#define  FLASH_SectorToErase    FLASH_WriteAddress

#define Erase 0
uint8_t Tx_Buffer[256];


uint8_t Rx_Buffer[BufferSize];
__IO uint32_t DeviceID = 0;
__IO uint32_t FlashID = 0;
__IO TestStatus TransferStatus1 = FAILED;

//字符串比较
TestStatus Buffercmp(uint8_t* pBuffer1, uint8_t* pBuffer2, uint16_t BufferLength);

//用于键盘扫描
void Timer_init(uint16_t per,uint16_t psc);
void Key_Scan(void);

void ScreenMain(void); //绘制主屏幕
void FlashRW(void); //Flash W25Q32读写测试
void ScreenMainItem(void); //绘制主屏幕图标选择框

int Pic2Flash(int nNo, int nPkgNo); //图片数据写入Flash（包括编号、头信息，每次写100dot像素的数据）
void ShowPicLine(int nNo, int nPkgNo); //显示一行图像数据
void ShowPicFlash(int nNo); //显示指定编号的FLASH上的图片到TFT上
void ShowPicComm(int nNo, int nPkgNo, int nStartX, int nStartY); //显示指定编号的串口传过来上的图片到TFT上

__IO uint32_t Flash_Size = 0;
int nCountSingleClick = 0; //主页面上短按计数
int nCountHoldClick = 0; //长按计数
char bScreenSaver = 0; //是否启用屏保

//大气压传感器
float bmp280_temp;
float bmp280_press;
float high;

long Press, Temp, High;
char PicShowFlag[100] = {0}; //对100个存储区的图片进行标记
int nBufferSize; //接收的数据大小

extern u16 USART_RX_STA;       //接收状态标记

#define PKGSIZE_DATA 212

extern uint8_t start_flag;
extern uint8_t Refinish1_Flag; //串口1接收完成标志位

int main()
{
	int nNo, nPkgNo;
	bool bRetWriteFlash = 1; //写Flash的返回值
	
	delay_init();
	LED_Init();//LED初始化
	Usart1_Init(115200); //(115200);
	SPI_FLASH_Init();

	LCD_Init();//LCD初始化
	//LCD_BLK_Set();//打开背光
	LCD_Fill(0, 0, LCD_W, LCD_H, WHITE);
	
	Timer_init(19, 7199); //10Khz的计数频率，计数到20为2ms,用于键盘检测

	bmp280Init();

	bmp280GetData(&bmp280_press,&bmp280_temp,&high);
	delay_ms(500);
	Press = bmp280_press * 1000;
	Temp = bmp280_temp * 1000;
	High = high * 1000;
	printf("bmp280_press:%ld\r\n",Press);
	delay_ms(100);
	printf("bmp280_temp :%ld\r\n", Temp);
	delay_ms(100);
	printf("bmp280_high :%ld\r\n\r\n", High);
	delay_ms(100);
	
	delay_ms(500);
	bmp280GetData(&bmp280_press,&bmp280_temp,&high);
	delay_ms(500);
	Press = bmp280_press * 1000;
	Temp = bmp280_temp * 1000;
	High = high * 1000;
	printf("bmp280_press2:%ld\r\n",Press);
	delay_ms(100);
	printf("bmp280_temp2 :%ld\r\n",Temp);
	delay_ms(100);
	printf("bmp280_high2 :%ld\r\n",High);
	delay_ms(100);

	LED = 0;
	PicShowFlag[63] = 1; //W25Q保存的图片标记（图像分布页面）
	PicShowFlag[74] = 1; 
	PicShowFlag[85] = 1; 
	PicShowFlag[99] = 1;
	
	/* 获取 Flash Device ID */
	DeviceID = SPI_FLASH_ReadDeviceID();

	/* 获取 SPI Flash ID */
	FlashID = SPI_FLASH_ReadID();
	printf("\r\nFlashID is 0x%X \r\nDevice ID is 0x%X\r\n", FlashID, DeviceID);

	/* 检验 SPI Flash ID */
	if (FlashID == W25Q16ID || W25Q32ID || W25Q64ID || W25Q80ID)
	{
		printf("\r\n检测到串行flash芯片!\r\n");
		switch (FlashID)
		{
		case W25Q16ID:
			printf("\r\nflash芯片型号为W25Q16ID!\r\n");
			Flash_Size = 2;
			break;
		case W25Q32ID:
			printf("\r\nflash芯片型号为W25Q32!\r\n");
			Flash_Size = 4;
			break;
		case W25Q64ID:
			printf("\r\nflash芯片型号为W25Q64!\r\n");
			Flash_Size = 8;
			break;
		case W25Q80ID:
			printf("\r\nflash芯片型号为W25Q80!\r\n");
			Flash_Size = 1;
			break;
		default:
			printf("\r\nflash芯片型号为其他!\r\n");
			Flash_Size = 0;
			break;
		}
		//FlashRW();//FLASH读写测试
	} else {
		printf("\r\n获取不到 W25QXX ID!\n\r");
	}

	delay_ms(500);
	LED = 1;//PC13熄灭
	
	//开机动画
	#define DELAY_LOGO_ANIMATION 200
	//Z 0x4285F4/0x443E
	Draw_SolidCircle(10 - 2, 20, 6, 0x443E);
	delay_ms(DELAY_LOGO_ANIMATION);
	Draw_SolidCircle(30 - 2, 20, 6, 0x443E);
	delay_ms(DELAY_LOGO_ANIMATION);
	Draw_SolidCircle(50 - 2, 20, 6, 0x443E);
	delay_ms(DELAY_LOGO_ANIMATION);
	Draw_SolidCircle(30 - 2, 40, 6, 0x443E);
	delay_ms(DELAY_LOGO_ANIMATION);
	Draw_SolidCircle(10 - 2, 60, 6, 0x443E);
	delay_ms(DELAY_LOGO_ANIMATION);
	Draw_SolidCircle(30 - 2, 60, 6, 0x443E);
	delay_ms(DELAY_LOGO_ANIMATION);
	Draw_SolidCircle(50 - 2, 60, 6, 0x443E);
	delay_ms(DELAY_LOGO_ANIMATION);
	//X 0xFBBC04/0xFDE0
	Draw_SolidCircle(70 - 2, 20, 6, 0xFDE0);
	delay_ms(DELAY_LOGO_ANIMATION);
	Draw_SolidCircle(110 - 2, 60, 6, 0xFDE0);
	delay_ms(DELAY_LOGO_ANIMATION);
	Draw_SolidCircle(110 - 2, 20, 6, 0xFDE0);
	delay_ms(DELAY_LOGO_ANIMATION);
	Draw_SolidCircle(90 - 2, 40, 6, 0xFDE0);
	delay_ms(DELAY_LOGO_ANIMATION);
	Draw_SolidCircle(70 - 2, 60, 6, 0xFDE0);
	delay_ms(DELAY_LOGO_ANIMATION);
	//I 0xE74639/0xE227
	Draw_SolidCircle(140 - 12, 20, 6, 0xE227);
	delay_ms(DELAY_LOGO_ANIMATION);	
	Draw_SolidCircle(140, 20, 6, 0xE227);
	delay_ms(DELAY_LOGO_ANIMATION);
	Draw_SolidCircle(140 + 12, 20, 6, 0xE227);
	delay_ms(DELAY_LOGO_ANIMATION);
	Draw_SolidCircle(140, 40, 6, 0xE227);
	delay_ms(DELAY_LOGO_ANIMATION);
	Draw_SolidCircle(140, 60, 6, 0xE227);
	delay_ms(DELAY_LOGO_ANIMATION);
	Draw_SolidCircle(140 - 12, 60, 6, 0xE227);
	delay_ms(DELAY_LOGO_ANIMATION);
	Draw_SolidCircle(140 + 12, 60, 6, 0xE227);
	delay_ms(DELAY_LOGO_ANIMATION);
	
	delay_ms(600);	
	
