joypoo/STM32F103TFT_MCU_PC_HW/PrgMCU/USER/main.c
	ScreenMain();
	usart1.RecLen = 0;
	
	while (1)
	{
		if(Refinish1_Flag == 1) { //串口传过来的图像保存到W25Qxx Flash及在TFT上显示
			Refinish1_Flag = 0;
			Parse_data();
			UsartdisData();
			
			nNo = usart1.RxBuff[8];
			nPkgNo = usart1.RxBuff[9];
			
			if (usart1.RxBuff[0] == 'Z' && usart1.RxBuff[1] == 'X' && usart1.RxBuff[2] == 'I' && usart1.RxBuff[3] == '_' & \
				usart1.RxBuff[4] == 'H' && usart1.RxBuff[5] == 'E' && usart1.RxBuff[6] == 'A' && usart1.RxBuff[7] == 'D') {
				
				for(int i = 0; i < 16; i++) {
					printf("%02X ", usart1.RxBuff[i]);
				}
				int nWidth = (int)(usart1.RxBuff[11] >> 8 | usart1.RxBuff[10]);
				int nHigh = (int)(usart1.RxBuff[13] >> 8 | usart1.RxBuff[12]);
				printf("<-- 图像头：[0x%08X], No.:%03d, PkgNo:%d, Width:%d, High:%d\r\n", 
					usart1.RxBuff[9], nNo, nPkgNo, nWidth, nHigh);
			
				for (int i = 0; i < 14; i++) {
					Tx_Buffer[i] = usart1.RxBuff[i];
				}
				
				bRetWriteFlash = Pic2Flash(nNo, nPkgNo);
				
				if (bRetWriteFlash == 0) 
					printf("ZXI>IMG HEAD Write Flash Suc.\r\n");
				else 
					printf("ZXI>IMG HEAD Write Flash Fail.\r\n");
				
				LCD_Fill(0, 0, LCD_W, LCD_H, WHITE);
				LCD_ShowString(2, 0, "    Get Image", GRAYBLUE, WHITE, 16, 0);
				LCD_ShowString(2, 16, "No.  W    H    ", GRAYBLUE, WHITE, 12, 0);
				LCD_ShowIntNumLeadingZeros(2, 28, nNo, 3, GRAYBLUE, WHITE, 12); //No
				LCD_ShowIntNumLeadingZeros(2 + 5 * 6, 28, nWidth, 4, GRAYBLUE, WHITE, 12); //Width
				LCD_ShowIntNumLeadingZeros(2 + 10 * 6, 28, nHigh, 4, GRAYBLUE, WHITE, 12); //High
			
			} else if (usart1.RxBuff[0] == 'Z' && usart1.RxBuff[1] == 'X' && usart1.RxBuff[2] == 'I' && usart1.RxBuff[3] == '_' &
				usart1.RxBuff[4] == 'D' && usart1.RxBuff[5] == 'A' && usart1.RxBuff[6] == 'T' && usart1.RxBuff[7] == 'A') {

				printf("<-- 图像数据区：[0x%08X], No.:%03d, PkgNo:%d\r\n", (usart1.RxBuff[9] - 1) * 200 + 8, nNo, nPkgNo);
			
				for (int i = 0; i < PKGSIZE_DATA; i++) {
					Tx_Buffer[i] = usart1.RxBuff[i];
				}
				
				bRetWriteFlash = Pic2Flash(nNo, nPkgNo);
				
				if (bRetWriteFlash == 0) 
					printf("ZXI>IMG DATA Write Flash Suc.\r\n");
				else 
					printf("ZXI>IMG DATA Write Flash Fail.\r\n");
				
				LCD_ShowString(2, 48, "DATA:" , GRAYBLUE, WHITE, 16, 0);				
				LCD_ShowString(2 + 5 * 8, 42, "No. PkgNo" , GRAYBLUE, WHITE, 12, 0);
				LCD_ShowIntNumLeadingZeros(2 + 5 * 8, 54, nNo, 3, GRAYBLUE, WHITE, 12); //No.
				LCD_ShowIntNumLeadingZeros(2 + 5 * 8 + 4 * 6, 54, nPkgNo, 3, GRAYBLUE, WHITE, 12); //PackageNo
				
				LCD_ShowString(2 + 9 * 8 + 4 * 8, 48, "0x" , GRAYBLUE, WHITE, 12, 0);
				LCD_ShowHEX(2 + 9 * 8 + 4 * 8 + 2 * 6 + 2, 48, usart1.RxBuff[10], GRAYBLUE, WHITE, 12); //rgb data
				LCD_ShowHEX(2 + 9 * 8 + 4 * 8 + 4 * 6 + 4, 48, usart1.RxBuff[11], GRAYBLUE, WHITE, 12); //rgb data
				LCD_ShowHEX(2 + 9 * 8 + 4 * 8 + 6 * 6 + 6, 48, usart1.RxBuff[12], GRAYBLUE, WHITE, 12); //rgb data
			
				if (nPkgNo == 128) {
					printf("数据写入完毕\r\n");
					ScreenMain(); //返回主页面
					bScreenMain = 1;
					nSubMenu = 0;
				}
			}
		}

		if (bGetBMP280Flag == 1) { //大气压、温度传感器数据获取及显示
			bGetBMP280Flag = 0;
			Press = bmp280_press * 1000;
			Temp = bmp280_temp * 1000;
			High = high * 1000;
			//printf("Press:%ld\r\n", Press);
			//printf("bmp280_press:%.4f\r\n", bmp280_press);
			//printf("bmp280_temp :%.2f\r\n", bmp280_temp);
			//printf("bmp280_high :%.1f\r\n\r\n", high); 
			
			if (bScreenMain == 1 && bScreenSaver == 0) {
				//温度
				LCD_ShowString(2, 65, "T:", BLUE, WHITE, 12, 0);
				
				if (bmp280_temp < 0) {
					LCD_ShowString(2 + 12, 65, "-", BLUE, WHITE, 12, 0);
					LCD_ShowFloatNum1(2 + 12 + 6, 65, -bmp280_temp, 4, GRAYBLUE, WHITE, 12);
					LCD_ShowString(2 + 12 + 5 * 6 + 6, 65, "C", BLUE, WHITE, 12, 0);
				} else {
					LCD_ShowFloatNum1(2 + 12, 65, bmp280_temp, 4, GRAYBLUE, WHITE, 12);
					LCD_ShowString(2 + 12 + 5 * 6, 65, "C", BLUE, WHITE, 12, 0);
				}

				//大气压
				LCD_ShowString(2 + 12 + 6 * 6,      65, " P:", BLUE, WHITE, 12, 0);
        LCD_ShowIntNumLeadingZeros(2 + 12 + 6 * 6 + 3 * 6, 65, (int)bmp280_press, 4, GRAYBLUE, WHITE, 12);
				LCD_ShowFloatNum1(         2 + 12 + 6 * 6 + 3 * 6 + 4 * 6, 65, (bmp280_press - (int)bmp280_press) * 100, 4, GRAYBLUE, WHITE, 12);
				LCD_ShowString(            2 + 12 + 6 * 6 + 3 * 6 + 4 * 6 + 5 * 6, 65, "Pa", BLUE, WHITE, 12, 0);
				//海拔
				LCD_ShowIntNumLeadingZeros(2 + 12 + 6 * 6 + 3 * 6 + 4 * 6 + 5 * 6 + 2 * 6, 65, high, 4, GRAYBLUE, WHITE, 12);
				//LCD_ShowFloatNum1(         2 + 12 + 6 * 6 + 3 * 6 + 4 * 6 + 5 * 6 + 2 * 6, 65, high / 100, 3, GRAYBLUE, WHITE, 12);
			} else if(nSubMenu == 2) { //在BMP280信息页面
	  		//温度
				//bmp280_temp -= 40; //测试负温度显示
  			LCD_ShowChinese(2, 12, "温度：", LBBLUE, WHITE, 16, 0);
				
				if (bmp280_temp < 0) {
					LCD_ShowString(2 + 6 * 8, 6, "-", GRAYBLUE, WHITE, 24, 0);
					LCD_ShowFloatNum1(2 + 6 * 8 + 12, 6, -bmp280_temp, 4, GRAYBLUE, WHITE, 24);
					LCD_ShowChinese(2 + 6 * 8 + 6 * 12, 10, "℃", GRAYBLUE, WHITE, 16, 0);			
				} else {
					LCD_ShowFloatNum1(2 + 6 * 8, 6, bmp280_temp, 4, GRAYBLUE, WHITE, 24);
					LCD_ShowChinese(2 + 6 * 8 + 5 * 12, 10, "℃", GRAYBLUE, WHITE, 16, 0);
				}
				//大气压
				LCD_ShowChinese(0, 32, "大气压：", LBBLUE, WHITE, 16, 0);
				LCD_ShowIntNumLeadingZeros(0 + 8 * 8, 32, (int)bmp280_press, 4, GRAYBLUE, WHITE, 16);
				LCD_ShowString(0 + 8 * 8 + 4 * 8, 32, ".", BLUE, WHITE, 16, 0);
				LCD_ShowIntNumLeadingZeros(0 + 8 * 8 + 4 * 8 + 1 * 8, 32, (bmp280_press - (int)bmp280_press) * 10000, 4, GRAYBLUE, WHITE, 16);
				LCD_ShowString(0 + 8 * 8 + 4 * 8 + 1 * 8 + 4 * 8, 32, "hPa", GRAYBLUE, WHITE, 16, 0);

				//海拔
				LCD_ShowChinese(2, 52, "海拔：", LBBLUE, WHITE, 16, 0);
				LCD_ShowIntNum(2 + 6 * 8, 52, (int)high, 7, GRAYBLUE, WHITE, 16);
			}
		}
		switch(g_KeyActionFlag)
    {
			case SHORT_KEY:
				//执行短按对应的事件
			  printf("KEY: SINGLE CLICK.\r\n");
				if(bScreenMain == 0) { //从子页面返回
					ScreenMain();
					bScreenMain = 1;
					nSubMenu = 0;
				} else { //在主页面
					if (bScreenSaver == 1) { //解除屏保
						bScreenSaver = 0;
						ScreenMain();
					}
					nCountSingleClick++;
					nCountSingleClick = nCountSingleClick > 3 ? 0 : nCountSingleClick;

