joypoo/STM32F103TFT_MCU_PC_HW/PrgMCU/USER/main.c
					LCD_Fill(0, 25 + 34, LCD_W, 25 + 36 + 6, WHITE); //清除gImage_x下指示^

					ScreenMainItem();
					//nCountSingleClick++;
				}
				g_KeyActionFlag = NULL_KEY; //(KEY_TYPE)0;		//状态回到空
				break;

			case LONG_KEY:
				//执行长按对应的事件
			  printf("KEY: HOLD CLICK.\r\n");
				//LCD_ShowString(2, 60, "KEY PRESS LONG ", BLUE, WHITE, 16, 0);
				if (nCountSingleClick == 1 && bScreenMain == 1) { //BMP280 info
					bScreenMain = 0; //标记为非主页面
					nSubMenu = 2;
					LCD_Fill(0, 0, LCD_W, LCD_H, WHITE);
				} else if (nCountSingleClick == 2 && bScreenMain == 1) { //module info
					bScreenMain = 0; //标记为非主页面
					//nSubMenu = 3;
					LCD_Fill(0, 0, LCD_W, LCD_H, WHITE);
					LCD_ShowString(0,  0, "MCU: STM32F103C8T6", LBBLUE, WHITE, 16, 0);
					LCD_ShowString(0, 16, "IPS: 0.96' 80RGB*160", LBBLUE, WHITE, 16, 0);
					LCD_ShowString(0, 32, "LCD Driver: ST7735S", LBBLUE, WHITE, 16, 0);
					LCD_ShowString(0, 48, "Pressure Sen: BMP280", LBBLUE, WHITE, 16, 0);
					LCD_ShowString(0, 64, "Power SOC: IP5306", LBBLUE, WHITE, 16, 0);
				} else if (nCountSingleClick == 3 && bScreenMain == 1) { //在主页面的"钥匙"按钮上长按
					bScreenSaver = 1;
					LCD_Fill(0, 0, LCD_W, LCD_H, BLACK); //全屏黑色填充
				} else { //显示W25Qxx Flash内的图片
					LCD_Fill(0, 0, LCD_W, LCD_H, WHITE);

					nCountHoldClick = nCountHoldClick > 100 ? 0 : nCountHoldClick;
					if(nCountHoldClick == 0) { //显示小恐龙
						LCD_ShowPicture(50, 10, 52, 60, gImage_1_5260);
					} else if (nCountHoldClick == 1) { //显示图片分布
						//LCD_ShowString(44, 28 - 6, "Page 2", GRAY, WHITE, 24, 0);
						for (int i = 0, j = 0; i < 5; i++) {
							
							for (int k = 0; k < 20; k++) {
								if (PicShowFlag[k + j * 20] == 1)
									LCD_ShowString(0 + k * 8, j * 16, (const u8*)"#", RED, WHITE, 16, 1);
								else
									LCD_ShowString(0 + k * 8, j * 16, (const u8*)"*", GRAYBLUE, WHITE, 16, 1);
							}
							if (j < 5) j++;
						}
					} else if (nCountHoldClick == 2) { //显示
						LCD_ShowString(4, 0, (const u8*)"Then, My Upload Pic", LBBLUE, WHITE, 16, 1);
						LCD_ShowString(9, 0, (const u8*)"Then, My Upload Pic", LBBLUE, WHITE, 16, 1);//叠加加粗
						LCD_ShowString(8, 16, (const u8*)"Width:160DOT", BLACK, WHITE, 16, 0);
						LCD_ShowString(8, 32, (const u8*)"High:80DOT", BLACK, WHITE, 16, 0);
						LCD_ShowString(8, 48, (const u8*)"Color:16bits(565)", BLACK, WHITE, 16, 0);
						LCD_ShowString(8, 64, (const u8*)"MSB First:Yes", BLACK, WHITE, 16, 0);
					} else {
						ShowPicFlash(nCountHoldClick);
					}
					nCountHoldClick++;

					bScreenMain = 0; //标记为非主页面
				}
				g_KeyActionFlag = NULL_KEY; //(KEY_TYPE)0;		//状态回到空
				break;
			
			default:
				break;
    }
	}
}

TestStatus Buffercmp(uint8_t* pBuffer1, uint8_t* pBuffer2, uint16_t BufferLength)
{
	while (BufferLength--)
	{
		if (*pBuffer1 != *pBuffer2)
		{
			return FAILED;
		}

		pBuffer1++;
		pBuffer2++;
	}
	return PASSED;
}

void FlashRW()
{
		/* 擦除将要写入的 SPI FLASH 扇区，FLASH写入前要先擦除 */
		// 这里擦除4K，即一个扇区，擦除的最小单位是扇区
		SPI_FLASH_SectorErase(FLASH_SectorToErase);
		
		/* 将发送缓冲区的数据写到flash中 */
		// 这里写一页，一页的大小为256个字节
		SPI_FLASH_BufferWrite(Tx_Buffer, FLASH_WriteAddress, BufferSize);
		printf("\r\n 写入的数据为：%s \r\t", Tx_Buffer);
		
		/* 将刚刚写入的数据读出来放到接收缓冲区中 */
		SPI_FLASH_BufferRead(Rx_Buffer, FLASH_ReadAddress, BufferSize);
		printf("\r\n 读出的数据为：%s \r\n", Rx_Buffer);
		
		/* 检查写入的数据与读出的数据是否相等 */
		TransferStatus1 = Buffercmp(Tx_Buffer, Rx_Buffer, BufferSize);

		if (PASSED == TransferStatus1) {
			printf("\r\n 串行flash测试成功!\n\r");
		} else {
			printf("\r\n 串行flash测试失败!\n\r");
		}
}

void ScreenMain()
{
	LCD_Fill(0, 0, LCD_W, LCD_H, WHITE);

	LCD_ShowString(5, 0, (const u8*)"ZoomeXplore.cn", RED, WHITE, 16, 0); //LCD_ShowChinese(95+24, 0, "探索", RED, WHITE, 16, 0);
	LCD_ShowPicture(160 - 16, 0, 16, 16, gImage_logo16x16); //logo
	LCD_ShowPicture(140, 25, 16, 32, gImage_4); //钥匙图标、黑屏
	LCD_ShowPicture(95, 18, 36, 40, gImage_3);  //系统信息
	LCD_ShowPicture(45, 30, 40, 28, gImage_2);  //BMP-280温度、大气压数据
	LCD_ShowPicture(5,  20, 33, 38, gImage_1);
	
	ScreenMainItem();
	LCD_ShowIntNum(143, 65, Flash_Size, 1, GRAYBLUE, WHITE, 12); LCD_ShowString(149, 65, (const u8*)"M", GRAYBLUE, WHITE, 12, 0);
}

void ScreenMainItem(void)
{
	LCD_ShowString(20 + nCountSingleClick * 40 + 3, 25 + 33, (const u8*)"^", RED, WHITE, 16, 1);//gImage_x下指示
	LCD_ShowString(20 + nCountSingleClick * 40 + 3, 25 + 34, (const u8*)"^", RED, WHITE, 16, 1);
	
	LCD_DrawRectangle(5 - 1, 20 + 38, 5 + 33 + 1, 20 + 38 + 1, WHITE);
	LCD_DrawRectangle(45 - 1, 30 + 28, 45 + 40 + 1, 30 + 28 + 1, WHITE);
	LCD_DrawRectangle(95 - 1, 18 + 40, 95 + 36 + 1, 18 + 40 + 1, WHITE);
	LCD_DrawRectangle(140 - 1, 25 + 32, 140 + 16 + 1, 25 + 32 + 1, WHITE);
	if (nCountSingleClick == 0) LCD_DrawRectangle(5 - 1, 20 + 38, 5 + 33 + 1, 20 + 38 + 1, RED);          //(5 - 1, 20 - 1, 5 + 33 + 1, 20 + 38 + 1, RED);
	else if (nCountSingleClick == 1) LCD_DrawRectangle(45 - 1, 30 + 28, 45 + 40 + 1, 30 + 28 + 1, RED);   //(45 - 1, 30 - 1, 45 + 40 + 1, 30 + 28 + 1, RED);
	else if (nCountSingleClick == 2) LCD_DrawRectangle(95 - 1, 18 + 40, 95 + 36 + 1, 18 + 40 + 1, RED);   //(95 - 1, 18 - 1, 95 + 36 + 1, 18 + 40 + 1, RED);
	else if (nCountSingleClick == 3) LCD_DrawRectangle(140 - 1, 25 + 32, 140 + 16 + 1, 25 + 32 + 1, RED); //(140 - 1, 25 - 1, 140 + 16 + 1, 25 + 32 + 1, RED);
}

void Timer_init(uint16_t per,uint16_t psc)
{
	//库函数版本
	//----------------------------------------------------------------//
	TIM_TimeBaseInitTypeDef TIM_TimeBaseInitStruct;
	NVIC_InitTypeDef NVIC_InitStruct;
	
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM3,ENABLE);
	
	TIM_TimeBaseInitStruct.TIM_ClockDivision = TIM_CKD_DIV1;
	TIM_TimeBaseInitStruct.TIM_CounterMode = TIM_CounterMode_Up;
	TIM_TimeBaseInitStruct.TIM_Period = per;
	TIM_TimeBaseInitStruct.TIM_Prescaler = psc;
	TIM_TimeBaseInit(TIM3, &TIM_TimeBaseInitStruct);
	
	TIM_ITConfig(TIM3,TIM_IT_Update,ENABLE);
	
	NVIC_InitStruct.NVIC_IRQChannel = TIM3_IRQn;
	NVIC_InitStruct.NVIC_IRQChannelPreemptionPriority = 1;
	NVIC_InitStruct.NVIC_IRQChannelSubPriority = 2;
	NVIC_InitStruct.NVIC_IRQChannelCmd = ENABLE;
	NVIC_Init(&NVIC_InitStruct);
	
	TIM_Cmd(TIM3,ENABLE);
	//----------------------------------------------------------------//
	
