joypoo/STM32F103TFT_MCU_PC_HW/PrgMCU/USER/main.c
	//寄存器版本
	//----------------------------------------------------------------//
//	RCC->APB1ENR |= (uint32_t)0x00000002; //打开定时器3的时钟
//	TIM3->CR1 &= (uint16_t)0xFF8F; //CMS[1:0]和DIR位清零
//	TIM3->CR1 |= (uint16_t)0x0000;   //设置计数为向上计数
//	
//	TIM3->CR1 &= (uint16_t)0xFCFF; //CKD[1:0]位清零
//	TIM3->CR1 |= (uint16_t)0x0000;   //设置1分频
//	
//	TIM3->ARR =  9999; //设置自动装载值
//	TIM3->PSC =  7199; //设置预分频值
//	
//	TIM3->EGR = (uint16_t)0x0001;
//	
//	TIM3->DIER |= (uint16_t)0x0001;
//	
//  my_tmppriority = (0x700 - ((SCB->AIRCR) & (uint32_t)0x700))>> 0x08;
//  my_tmppre = (0x4 - my_tmppriority);
//  my_tmpsub = my_tmpsub >> my_tmppriority;

//  my_tmppriority = 1 << my_tmppre; //抢占优先级为1
//  my_tmppriority |=  2 & my_tmpsub;//子优先级为2
//  my_tmppriority = my_tmppriority << 0x04;
//	
//	NVIC->IP[TIM3_IRQn] = my_tmppriority;
//	NVIC->ISER[TIM3_IRQn >> 0x05] =(uint32_t)0x01 << (TIM3_IRQn & (uint8_t)0x1F);//开启通道
//	//NVIC->ISER[0] =1<<29;
//	TIM3->CR1 |= (uint16_t)0x0001;
}

/**
 * 单个按键检测短按和长按事件
 * 短按：时间 10ms < T < 1 s, 长按：时间 T >1 s
 * 功能：使用状态机方式，扫描单个按键；扫描周期为10ms,10ms刚好跳过抖动；
 * 状态机使用switch case语句实现状态之间的跳转
 * lock变量用于判断是否是第一次进行按键确认状态
 * ：按键释放后才执行按键事件
 */
void Key_Scan0(void)
{
    static u8 TimeCnt = 0;
    static u8 lock = 0;
    switch(KeyState)
    {
        //按键未按下状态，此时判断Key的值
        case KEY_CHECK:    
					if(Key)   //!Key
					{
						KeyState =  KEY_COMFIRM;  //如果按键Key值为0，说明按键开始按下，进入下一个状态 
					}
					TimeCnt = 0;                  //计数复位
					lock = 0;
					break;
            
        case KEY_COMFIRM:
					if(Key)  //!Key                   //查看当前Key是否还是0，再次确认是否按下
					{
						if(!lock)   lock = 1;
						TimeCnt++;
					}   
					else                       
					{
							if(lock)                // 不是第一次进入，  释放按键才执行
							{
									//按键时长判断
									if(TimeCnt > 100)            // 长按 1 s
									{
											g_KeyActionFlag = LONG_KEY;
											TimeCnt = 0;  
									}
									else                         // Key值变为了1，说明此处动作为短按
									{
											g_KeyActionFlag = SHORT_KEY;          // 短按
									}
									
									KeyState =  KEY_RELEASE;    // 需要进入按键释放状态 
							}
							else                          // 当前Key值为1，确认为抖动，则返回上一个状态
							{
									KeyState =  KEY_CHECK;    // 返回上一个状态
							}
					} 
          break;
            
        case KEY_RELEASE:
          if(!Key) //Key                    //当前Key值为1，说明按键已经释放，返回开始状态
          { 
            KeyState =  KEY_CHECK;    
          }
          break;
             
        default: 
					break;
    }    
}

/**
 * 单个按键检测短按和长按事件
 * 短按：时间 10ms < T < 1 s, 长按：时间 T >1 s
 * 功能：使用状态机方式，扫描单个按键；扫描周期为10ms,10ms刚好跳过抖动；
 * 状态机使用switch case语句实现状态之间的跳转
 * lock变量用于判断是否是第一次进行按键确认状态
 * 长按键事件提前执行，短按键事件释放后才执行
 */
//u8 TimeCnt = 0;
//u8 lock = 0;
void Key_Scan(void)
{
		static u8 TimeCnt = 0;
    static u8 lock = 0;
	
    switch (KeyState)
    {
        //按键未按下状态，此时判断Key的值
        case KEY_CHECK:    
           if(Key)   //!Key 
            {
							//printf("KeyState=KEY_CHECK !Key\r\n");
              KeyState = KEY_COMFIRM;  //如果按键Key值为0，说明按键开始按下，进入下一个状态 
            }
            TimeCnt = 0;                  //计数复位
            lock = 0;
            break;
            
        case KEY_COMFIRM:
            if(Key)  //!Key                   //查看当前Key是否还是0，再次确认是否按下
            {
              if(!lock) lock = 1;
               	
							//printf("KeyState=KEY_COMFIRM !Key\r\n");

              TimeCnt++;  
                
              //按键时长判断
              if(TimeCnt > 100)            // 长按 1 s
              {
                g_KeyActionFlag = LONG_KEY;
                TimeCnt = 0;  
                lock = 0;               //重新检查
                KeyState = KEY_RELEASE;    // 需要进入按键释放状态
              }
            }   
            else                       
            {
              if(1 == lock)                // 不是第一次进入，  释放按键才执行
              {
                g_KeyActionFlag = SHORT_KEY;          // 短按
                KeyState = KEY_RELEASE;    // 需要进入按键释放状态 
              }
              else                          // 当前Key值为1，确认为抖动，则返回上一个状态
              {
                KeyState = KEY_CHECK;    // 返回上一个状态
              }
            } 
            break;
            
         case KEY_RELEASE:
             if(!Key)   //Key                  //当前Key值为1，说明按键已经释放，返回开始状态
             { 
                 KeyState = KEY_CHECK;    
             }
						 break;
             
         default: 
					 break;
    }    
}

void TIM3_IRQHandler(void)   //TIM3 每 2ms 中断一次
{   
	static u8 cnt;
	static u16 cnt_bmp280; //	1000ms取一次BMP280数据

	if(TIM_GetITStatus(TIM3, TIM_IT_Update) != RESET) //检查指定的TIM中断发生与否:TIM 中断源    
	{
		cnt++;
		cnt_bmp280++;
		
    if(cnt > 5)	//每10ms 执行一次按键扫描程序
    {
			Key_Scan();
			cnt = 0;
			//printf("TIM3 IRQ\r\n");
    }

		if (cnt_bmp280 > 500) {
			bmp280GetData(&bmp280_press, &bmp280_temp, &high);
			bGetBMP280Flag = 1;
			cnt_bmp280 = 0;
		}
    TIM_ClearITPendingBit(TIM3, TIM_IT_Update);  //清除TIMx的中断待处理位:TIM 中断源
	}
}

//图片数据写入Flash（包括编号、头信息，建议每次写半行像素的数据）
//nPkgNo为0时为数据头，    包括协议头"ZXI_HEAD"(8BYTE)+图像编号(1BYTE)+包编号0(1BYTE)+宽度MSB(1BYTE)+宽度LSB(1BYTE)+高度MSB(1BYTE)+高度LSB(1BYTE)信息
//nPkgNo>0时为图像RGB数据，包括协议头"ZXI_DATA"(8BYTE)+图像编号(1BYTE)+包编号N(1BYTE)+RGB数据(n BYTE)，每次传200字节图像有效信息，最后一包不足200用0x00填充
int Pic2Flash(int nNo, int nPkgNo)
{
	u32 nAdrStart = 0x00000;
	
	nAdrStart = nAdrStart + (nNo - 1) * 4 * 1024 * 8; //每个编号的数据分配160*80*2=25600<4*1024*8=32768字节的空间

	//擦除将要写入的 SPI FLASH 扇区，FLASH写入前要先擦除
	//这里擦除4K，即一个扇区，擦除的最小单位是扇区,一个图片占用32K空间
	if (nPkgNo == 0) {
		SPI_FLASH_SectorErase(nAdrStart);
		SPI_FLASH_SectorErase(nAdrStart + 1 * 4096);
		SPI_FLASH_SectorErase(nAdrStart + 2 * 4096);
		SPI_FLASH_SectorErase(nAdrStart + 3 * 4096);
		SPI_FLASH_SectorErase(nAdrStart + 4 * 4096);
		SPI_FLASH_SectorErase(nAdrStart + 5 * 4096);
		SPI_FLASH_SectorErase(nAdrStart + 6 * 4096);
		SPI_FLASH_SectorErase(nAdrStart + 7 * 4096);
		//SPI_FLASH_SectorErase(nAdrStart + 8 * 4096);//最后一行图像占据了一个扇区，有点浪费，
																								//可以考虑把文件头数据另存到一个单独扇区上，
																								//类似MBR，文件分布、损坏的扇区分布都保存在一起，并做备份保存
	}
	//将发送缓冲区的数据写到flash中
	//这里写一页，一页的大小为256个字节,实际写入208+2字节,W25Q利用率大约78%
	nAdrStart += nPkgNo * 256;
	//nBufferSize = /*(nPkgNo == 0) ? 14 : */PKGSIZE_DATA;
	nBufferSize = (nPkgNo == 0) ? 14 : PKGSIZE_DATA;
	SPI_FLASH_BufferWrite(Tx_Buffer, nAdrStart, nBufferSize);
	
//if (nPkgNo == 1) {
//	printf("ZXI>写入的数据为(%d): \r\n", nBufferSize);
//	for (int i = 0; i < nBufferSize; i++) {
//		printf("%02X ", Tx_Buffer[i]);
//	}

//	printf("\r\n------------\r\n");
		//将刚刚写入的数据读出来放到接收缓冲区中
		SPI_FLASH_BufferRead(Rx_Buffer, nAdrStart, nBufferSize);
//	printf("ZXI>读出的数据为(%d) \r\n", nBufferSize);
//		for (int i = 0; i < nBufferSize; i++) {
//			printf("%02X ", Rx_Buffer[i]);
//	}
//	printf("\r\n------------\r\n");
		//检查写入的数据与读出的数据是否相等
		TransferStatus1 = Buffercmp(Tx_Buffer, Rx_Buffer, nBufferSize);

		if (PASSED == TransferStatus1) {
		//printf("ZXI>Addr:0x%08X,串行flash写读成功!\r\n", nAdrStart);
			return 0; //写入成功返回0，不是PASSED
		} else {
			//printf("ZXI>串行flash写读失败!\r\n");
			return 1; //写入失败返回1，不是FAILED
		}
		return 0;
//}
//return 0;
}

//显示指定编号的FLASH上的图片到TFT上
void ShowPicFlash(int nCountHoldClick)
{
	LCD_Address_Set(0, 0, 159, 79);
	for (int r = 1; r < 129; r++) {
		ShowPicLine(nCountHoldClick, r);
	}
	LCD_ShowIntNumLeadingZeros(159 - 3 * 8, 0, nCountHoldClick - 2, 3, GRAYBLUE, WHITE, 16);
}

//显示一包图像数据
void ShowPicLine(int nNo, int nPkgNo)
{
	u32 nAdrStart = 0x00000;
	int nBufferSize = 256;
	uint8_t Rx_Buffer_Pic[200];
	u32 k = 0;
	nAdrStart = nAdrStart + (nNo - 1) * 4 * 1024 * 8;

	//LCD_Address_Set(0, 0, 0 + 160 - 1, 0 + 80 - 1);
	SPI_FLASH_BufferRead(Rx_Buffer, nAdrStart + nPkgNo * 256, nBufferSize);
	
	for(int i = 0; i < 200; i++) {
		Rx_Buffer_Pic[i] = Rx_Buffer[ i + 10];
	}
	
	for(int j = 0; j < 100; j++)
	{
		LCD_WR_DATA8(Rx_Buffer_Pic[k * 2 + 1]);
		LCD_WR_DATA8(Rx_Buffer_Pic[k * 2]);
		k++;
	}
}

//显示指定编号的串口传过来上的图片到TFT上
void ShowPicComm(int nNo, int nPkgNo, int nStartX, int nStartY)
{

}
